Repository: KDE/plasma-vault
Catalog: po/*/plasmavault-kde.po
Languages: be, eo

# @action Action to unmount a vault
source: Close this Plasma Vault
be: Закрыць гэтае сховішча Plasma Vault
eo: Fermi ĉi tiun Plasman trezorejon

# @action Action to mount a vault
source: Open this Plasma Vault
be: Адкрыць гэтае сховішча Plasma Vault
eo: Malfermi ĉi tiun Plasma trezorejon

source: Failed to create directories, check your permissions
be: Не ўдалося стварыць каталог, праверце свае правы доступу
eo: Malsukcesis krei dosierujojn, kontrolu viajn permesojn

source: Upgrade the vault?
be: Абнавіць сховішча?
eo: Ĉu altgradigi la trezorejon?

source: This vault was created with an older version of cryfs and needs to be upgraded. Mind that this process is irreversible and the vault will no longer work with older versions of cryfs. Do you want to perform the upgrade now?
be: Гэтае сховішча было створана са старой версіяй Cryfs, яго трэба абнавіць. Звярніце ўвагу на тое, што гэты працэс незваротны, і сховішча больш не будзе працаваць са старымі версіямі Cryfs. Хочаце выканаць абнаўленне?
eo: Ĉi tiu trezorejo estis kreita kun pli malnova versio de cryfs kaj devas esti ĝisdatigita. Atentu, ke ĉi tiu procezo estas neinversigebla kaj la trezorejo ne plu funkcios kun pli malnovaj versioj de cryfs. Ĉu vi volas fari la ĝisdatigon nun?

source: The vault needs to be upgraded before it can be opened with this version of cryfs
be: Перш чым можна будзе адкрыць сховішча з дапамогай гэтай версіі Cryfs, яго трэба абнавіць
eo: La trezorejo devas esti ĝisdatigita antaŭ ol ĝi povas esti malfermita kun ĉi tiu versio de cryfs

source: The mount point directory is not empty, refusing to open the vault
be: Каталог пункта мантавання не пусты, адкрыццё не будзе выканана
eo: La muntapunkta dosierujo ne estas malplena, rifuzante malfermi la trezorejon

source: You entered the wrong password
be: Вы ўвялі няправільны пароль
eo: Vi enigis malĝustan pasvorton

source: The installed version of cryfs is too old to open this vault.
be: Усталяваная версія cryfs занадта старая, каб адкрыць гэтае сховішча.
eo: La instalita versio de cryfs estas tro malnova por malfermi ĉi tiun trezorejon.

source: Unable to perform the operation (error code %1).
be: Не ўдалося выканаць аперацыю (код памылкі %1).
eo: Ne eblas plenumi la operacion (erara kodo %1).

source: The cipher directory is not empty, cannot initialise the vault.
be: Каталог шыфравання не пусты, не ўдалося ініцыялізаваць сховішча.
eo: La ĉifra dosierujo ne estas malplena, ne povas pravalorigi la trezorejon.

source: The password is empty, cannot initialise the vault.
be: Пароль пусты, не ўдалося ініцыялізаваць сховішча.
eo: La pasvorto estas malplena, ne povas pravalorigi la trezorejon.

source: Cannot write gocryptfs.conf inside cipher directory, check your permissions.
be: Не ўдалося запісаць gocryptfs.conf у каталог шыфравання, праверце свае правы доступу.
eo: Ne povas skribi gocryptfs.conf ene de ĉifro dosierujo, kontrolu viajn permesojn.

source: Failed to execute
be: Не ўдалося выканаць
eo: Malsukcesis plenumi

source: Unable to detect the version
be: Немагчыма вызначыць версію
eo: Ne eblas detekti la version

source: Unable to detect the version, the version string is invalid
be: Немагчыма вызначыць версію, запіс версіі хібны
eo: Ne eblas detekti la version, la versio ĉeno estas nevalida

source: Wrong version installed. The required version is %1.%2
be: Усталявана няправільная версія. Патрэбная версія - %1.%2
eo: Malĝusta versio instalita. La bezonata versio estas %1.%2

source: Correct version found
be: Знойдзена правільная версія
eo: Ĝusta versio trovita

source: Unable to perform the operation
be: Не ўдалося выканаць аперацыю
eo: Ne eblas plenumi la operacion

source: This directory already contains encrypted data
be: Гэты каталог ужо змяшчае зашыфраваныя даныя
eo: Ĉi tiu dosierujo jam enhavas ĉifritajn datumojn

source: You need to select empty directories for the encrypted storage and for the mount point
be: Вам трэба абраць пустыя каталогі для зашыфраванага сховішча і для пункта мантавання
eo: Vi devas elekti malplenajn dosierujojn por la ĉifrita konservado kaj por la munta punkto

source: This directory doesn't contain encrypted data
be: Гэты каталог не змяшчае зашыфраваныя даныя
eo: Ĉi tiu dosierujo ne enhavas ĉifritajn datumojn

source: You need to select an empty directory for the mount point
be: Вам трэба абраць пусты каталог для пункта мантавання
eo: Vi devas elekti malplenan dosierujon por la munta punkto

source: Device is already open
be: Прылада ўжо адкрытая
eo: La aparato jam estas malfermita

source: Device is not open
be: Прылада не адкрытая
eo: La aparato ne estas malfermita

source: Wrong version installed. The required version is %1.%2.%3
be: Усталявана няправільная версія. Патрэбная версія - %1.%2.%3
eo: Malĝusta versio instalita. La bezonata versio estas %1.%2.%3

source: Unknown device
be: Невядомая прылада
eo: Nekonata aparato

source: Configured backend does not exist: %1
be: Наладжаны рухавік не існуе: %1
eo: Agordita backend ne ekzistas: %1

source: Mount point is not specified
be: Пункт мантавання не вызначаны
eo: Montpunkto ne estas precizigita

source: Cannot create the mount point
be: Не ўдалося стварыць пункт мантавання
eo: Ne povas krei la muntan punkton

source: Configured backend cannot be instantiated: %1
be: Наладжаны рухавік не можа быць рэалізаваны: %1
eo: Agordita backend ne povas esti instantiigita: %1

source: This device is already registered. Cannot recreate it.
be: Гэтая прылада ўжо зарэгістраваная. Яе немагчыма перастварыць.
eo: Ĉi tiu aparato jam estas registrita. Ne povas rekrei ĝin.

source: Unknown error; unable to create the backend.
be: Невядомая памылка; не ўдалося стварыць рухавік.
eo: Nekonata eraro; ne povas krei la backend.

source: This device is not initialized. Cannot import it.
be: Гэтая прылада не ініцыялізаваная. Яе немагчыма імпартаваць.
eo: Ĉi tiu aparato ne estas pravigita. Ne povas importi ĝin.

source: Cannot open an unknown vault.
be: Немагчыма адкрыць невядомае сховішча.
eo: Ne povas malfermi nekonatan trezorejon.

source: The vault is unknown; cannot close it.
be: Невядомае сховішча; яго немагчыма адкрыць.
eo: La trezorejo estas nekonata; ne povas fermi ĝin.

source: Unable to close the vault because an application is using it
be: Немагчыма закрыць сховішча, бо яго выкарыстоўвае праграма
eo: Ne eblas fermi la trezorejon ĉar aplikaĵo uzas ĝin

source: Unable to close the vault because it is being used by %1
be: Немагчыма закрыць сховішча, бо яго выкарыстоўвае %1
eo: Ne eblas fermi la trezorejon ĉar ĝi estas uzata de %1

source: Failed to fetch the list of applications using this vault
be: Не ўдалося атрымаць спіс праграм, якія выкарыстоўваюць гэтае сховішча
eo: Malsukcesis alporti la liston de aplikaĵoj uzante ĉi tiun trezorejon

source: Cannot delete the vault; there are other vaults with overlapping paths.
be: Немагчыма выдаліць сховішча; ёсць іншыя сховішчы са звязанымі шляхамі.
eo: Ne povas forigi la trezorejon; estas aliaj trezorejoj kun interkovritaj padoj.

source: The vault is unknown; cannot dismantle it.
be: Невядомае сховішча; яго нельга дэмантаваць.
eo: La trezorejo estas nekonata; ne povas malmunti ĝin.

source: Are you sure you want to delete this vault
be: Сапраўды хочаце выдаліць гэтае сховішча
eo: Ĉu vi certas, ke vi volas forigi ĉi tiun trezorejon

source: This operation will irreversibly delete the following: %1 %2
be: Пры выкананні гэтай аперацыя незваротна выдаліцца наступнае: %1 %2
eo: Ĉi tiu operacio neinversigeble forigos la jenon: %1 %2

source: Delete operation cancelled
be: Аперацыя выдалення скасаваная
eo: Forigi operacio nuligita

source: Error deleting vault
be: Не ўдалося выдаліць сховішча
eo: Eraro dum forigo de la trezorejo

source: If you limit this vault only to certain activities, it will be shown in the applet only when you are in those activities. Furthermore, when you switch to an activity it should not be available in, it will automatically be closed.
be: Калі вы абмяжуеце паказ гэтага сховішча толькі для пэўных пакояў, яно будзе паказвацца ў аплеце толькі тады, калі вы будзеце знаходзіцца ў гэтых пакоях. Акрамя таго, калі вы перойдзеце ў пакой, у якім сховішча не павінна быць даступна, яно аўтаматычна закрыецца.
eo: Se vi limigas ĉi tiun trezorejon nur al certaj agadoj, ĝi estos montrita en la apleto nur kiam vi estas en tiuj agadoj. Krome, kiam vi ŝanĝas al agado, en kiu ĝi ne devus esti disponebla, ĝi aŭtomate fermiĝos.

source: Limit to the selected activities:
be: Паказваць толькі ў абраных пакоях:
eo: Limigi al la elektitaj agadoj:

source: The specified backend is not available
be: Вызначаны рухавік недаступны
eo: La specifita backend ne estas disponebla

source: Vaul&t name:
be: Назва &сховішча:
eo: Vol&t nomo:

source: Backend:
be: Рухавік:

source: Change
be: Змяніць
eo: Ŝanĝi

source: Choose the encryption system you want to use for this vault:
be: Абярыце сістэму шыфравання, якую хочаце выкарыстоўваць для гэтага сховішча:
eo: Elektu la ĉifradan sistemon, kiun vi volas uzi por ĉi tiu trezorejo:

source: Use the default cipher
be: Выкарыстоўваць прадвызначанае шыфраванне
eo: Uzi la defaŭltan ĉifron

source: Choose the used cipher:
be: Абраць шыфраванне:
eo: Elektu la uzatan ĉifron:

source: Mount point:
be: Пункт мантавання:
eo: Montpunkto:

source: The specified path does not exist
be: Вызначаны шлях не існуе
eo: La specifita vojo ne ekzistas

source: The specified directory is not empty
be: Вызначаны каталог не пусты
eo: La specifita dosierujo ne estas malplena

source: The specified directory is empty
be: Вызначаны каталог пусты
eo: La specifita dosierujo estas malplena

source: Encrypted data location
be: Размяшчэнне зашыфраваных даных
eo: Ĉifrita datumloko

source: Mount point
be: Пункт мантавання
eo: Montpunkto

# %1 is the name of the Plasma Vault to open
source: Open '%1' Plasma Vault
be: Адкрыць сховішча Plasma "%1"
eo: Malfermi '%1' Plasma trezorejon

source: Details…
be: Падрабязнасці…
eo: Detaloj…

source: Command output: %1 Error output: %2
be: Вывад каманды: %1 Вывад памылкі: %2
eo: Komanda eligo: %1 Erara eligo: %2

source: Error details
be: Падрабязнасці памылкі
eo: Detaloj pri eraro

source: Failed to open: %1
be: Не ўдалося адкрыць: %1
eo: Malsukcesis malfermi: %1

source: Please enter the password to open this vault:
be: Увядзіце пароль, каб адкрыць гэтае сховішча:
eo: Bonvolu enigi la pasvorton por malfermi ĉi tiun trezorejon:

source: Password:
be: Пароль:
eo: Pasvorto:

source: Do not show this notice again
be: Больш не паказваць гэтае апавяшчэнне
eo: Ne montri ĉi tiun avizon denove

source: Go offline while this vault is open (switch off networking and bluetooth)
be: Пераходзіць у пазасеткавы рэжым, пакуль гэтае сховішча адкрыта (адключаць сетку і Bluetooth)
eo: Malkonektas dum ĉi tiu trezorejo estas malfermita (malŝaltu reton kaj bluetooth)

source: Mind that there is no way to recover a forgotten password. If you forget the password, your data is as good as gone.
be: Майце на ўвазе, што няма магчымасці аднавіць забыты пароль. Калі вы забудзеце пароль, вашыя даныя знікнуць.
eo: Atentu, ke ne ekzistas maniero reakiri forgesitan pasvorton. Se vi forgesas la pasvorton, viaj datumoj estas kiel malaperintaj.

source: General
be: Асноўныя
eo: Ĝenerala

source: Advanced
be: Дадатковыя
eo: Altnivela

source: Delete
be: Выдаліць
eo: Forigi

source: Configure
be: Наладжванне
eo: Agordi

source: Dialog
be: Дыялогавае акно
eo: Dialogo

source: The vault configuration can only be changed while it is closed.
be: Канфігурацыю сховішча можна змяніць, толькі калі яно закрыта.
eo: La trezorejo povas esti ŝanĝita nur dum ĝi estas fermita.

source: Close the vault
be: Закрыць сховішча
eo: Fermi la trezorejon

source: <b>Security notice:</b> According to a security audit by Taylor Hornby (Defuse Security), the current implementation of Encfs is vulnerable or potentially vulnerable to multiple types of attacks. For example, an attacker with read/write access to encrypted data might lower the decryption complexity for subsequently encrypted data without this being noticed by a legitimate user, or might use timing analysis to deduce information. <br /><br /> This means that you should not synchronize the encrypted data to a cloud storage service, or use it in other circumstances where the attacker can frequently access the encrypted data. <br /><br /> See <a href='https://defuse.ca/audits/encfs.htm'>defuse.ca/audits/encfs.htm</a> for more information.
be: <b>Апавяшчанне бяспекі:</b> Згодна з аўдытам бяспекі ад Taylor Hornby (Defuse Security), бягучая рэалізацыя Encfs уразлівая або патэнцыйна ўразлівая да некалькіх тыпаў нападаў. Напрыклад, зламыснік з правам чытання/запісу зашыфраваных даных можа панізіць складанасць дэшыфравання для зашыфраваных даных, і гэтага не заўважыць законны карыстальнік, або можа аналізаваць час аперацый для выяўлення інфармацыі. <br /><br /> Гэта азначае, што вы не павінны сінхранізаваць зашыфраваныя даныя ў воблачную службу для захоўвання даных, або захоўваць іх ў іншых месцах, дзе зламыснік можа атрымаць доступ да зашыфраваных даных. <br /><br /> Каб даведацца больш падрабязна, глядзіце <a href='https://defuse.ca/audits/encfs.htm'>defuse.ca/audits/encfs.htm</a>.

source: <b>Security notice:</b> CryFS encrypts your files, so you can safely store them anywhere. It works well together with cloud services like Dropbox, iCloud, OneDrive and others. <br /><br /> Unlike some other file-system overlay solutions, it does not expose the directory structure, the number of files nor the file sizes through the encrypted data format. <br /><br /> One important thing to note is that, while CryFS is considered safe, there is no independent security audit which confirms this.
be: <b>Апавяшчэнне бяспекі:</b> CryFS шыфруе вашыя файлы, таму вы можаце бяспечна захоўваць іх у любым месцы. CryFS добра працуе разам з воблачнымі сэрвісамі, такімі як Dropbox, iCloud, OneDrive і іншымі. <br /><br /> У адрозненні ад некаторых іншых рашэнняў, CryFS не раскрывае структуру каталогаў, колькасць файлаў, памер файлаў, бо выкарыстоўвае зашыфраваны фармат даных. <br /><br /> Важна адзначыць, што хоць CryFS і лічыцца бяспечным, не праводзілася незалежнага аўдыту бяспекі, каб пацвердзіць гэта.

source: <b>Security notice:</b> Gocryptfs encrypts your files, so you can safely store them anywhere. It works well together with cloud services like Dropbox, iCloud, OneDrive and others. <br /><br /> A threat model for gocryptfs is provided by the author at <a href='https://nuetzlich.net/gocryptfs/threat_model'>nuetzlich.net/gocryptfs/threat_model</a>. <br /><br /> According to a security audit performed in 2017 by Taylor Hornby (Defuse Security), gocryptfs keeps file contents secret against an adversary that can read and modify the ciphertext. <br /><br /> See <a href='https://defuse.ca/audits/gocryptfs.htm'>defuse.ca/audits/gocryptfs.htm</a> for more information.
be: <b>Апавяшчэнне бяспекі:</b> Gocryptfs шыфруе вашыя файлы, таму вы можаце бяспечна захоўваць іх у любым месцы. Gocryptfs добра працуе разам з воблачнымі сэрвісамі, такімі як Dropbox, iCloud, OneDrive і іншымі. <br /><br /> Мадэль урадлівасці для gocryptfs пададзеная аўтарам на <a href='https://nuetzlich.net/gocryptfs/threat_model'>nuetzlich.net/gocryptfs/threat_model</a>. <br /><br /> Згодна з аўдытам бяспекі, які ў 2017 годзе выканаў Taylor Hornby (Defuse Security), gocryptfs захоўвае змесціва файла ў сакрэце ад зламысніка, які можа чытаць і змяняць зашыфраваны тэкст. <br /><br /> Каб даведацца больш падрабязна, глядзіце <a href='https://defuse.ca/audits/gocryptfs.htm'>defuse.ca/audits/gocryptfs.htm</a>.

# @title:window
source: Create a New Vault
be: Стварыць новае сховішча
eo: Krei Novan Trezorejon

source: This action <b>cannot</b> be undone. This will permanently delete the selected vault!
be: Гэта дзеянне <b>немагчыма</b> адрабіць. Абранае сховішча будзе выдалена назаўжды!
eo: Ĉi tiu ago <b>ne povas</b> esti malfarita. Ĉi tio konstante forigos la elektitan trezorejon!

source: Please type in the name of the vault to confirm:
be: Каб пацвердзіць, увядзіце назву сховішча:
eo: Bonvolu tajpi la nomon de la trezorejo por konfirmi:

source: Delete this vault
be: Выдаліць гэтае сховішча
eo: Forigi ĉi tiun trezorejon

source: Import
be: Імпартаванне
eo: Importi

# @title:window
source: Import an Existing Vault
be: Імпартаваць наяўнае сховішча
eo: Importi Ekzistantan Trezorejon

source: Next
be: Далей
eo: Poste

source: Create
be: Стварыць
eo: Krei

source: Previous
be: Назад
eo: Antaŭa

source: Create a New Vault…
be: Стварыць новае сховішча…
eo: Krei Novan Trezorejon…

source: No Vaults have been set up
be: Няма наладжаных сховішчаў
eo: Neniuj Trezorejoj estis starigitaj

source: Lock Vault
be: Заблакаваць сховішча
eo: Ŝlosi Trezorejon

source: Unlock and Open
be: Разблакаваць і адкрыць
eo: Malŝlosi kaj Malfermi

source: Show in File Manager
be: Паказаць у кіраўніку файлаў
eo: Montri en Dosiera Administranto

source: Forcefully Lock Vault
be: Прымусова заблакаваць сховішча
eo: Perforte Ŝlosi Trezorejon

source: Unlock Vault
be: Разблакаваць сховішча
eo: Malŝlosi Trezorejon

source: Configure Vault…
be: Наладжванне сховішча…
eo: Agordi Trezorejon…

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'hlv'; font-size:9pt; font-weight:400; font-style:normal;"> <p style="-qt-paragraph-type:empty; margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><br /></p></body></html>
eo: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html> <head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'hlv'; font-size:9pt; font-weight:400; font-style:normal;"> <p style="-qt-paragraph-type:malplena; margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent: 0px;"><br /></p></body></html>
